In [1]:
import pandas as pd
import numpy as np

#### Слияние данных

In [2]:
authors = pd.DataFrame({'author_id': [1, 2, 3],
                        'author_name': ['Pushkin', 'Tolstoy', 'Dostoevsky']}, columns = ['author_id', 'author_name'])

In [3]:
authors

   author_id author_name
0          1     Pushkin
1          2     Tolstoy
2          3  Dostoevsky

In [4]:
books = pd.DataFrame({'author_id': [2, 3, 3, 4],
                      'book_title': ['War and Peace', 'The Idiot', 'Crime and Punishment', 'Fathers and Sons']}, columns = ['author_id', 'book_title'])

In [5]:
books

   author_id            book_title
0          2         War and Peace
1          3             The Idiot
2          3  Crime and Punishment
3          4      Fathers and Sons

#### Merge

In [6]:
df1 = pd.merge(authors, books, on='author_id', how='inner') # inner = if exist value show string

In [7]:
df1

   author_id author_name            book_title
0          2     Tolstoy         War and Peace
1          3  Dostoevsky             The Idiot
2          3  Dostoevsky  Crime and Punishment

In [8]:
df2 = pd.merge(authors, books, on='author_id', how='left') # left = show all values in left column

In [9]:
df2

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment

In [10]:
df3 = pd.merge(authors, books, on='author_id', how='right') # right = show all values in right column

In [11]:
df3

   author_id author_name            book_title
0          2     Tolstoy         War and Peace
1          3  Dostoevsky             The Idiot
2          3  Dostoevsky  Crime and Punishment
3          4         NaN      Fathers and Sons

In [12]:
df4 =pd.merge(authors, books, on='author_id', how='outer') # outer = show all values in both columns

In [13]:
df4

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4         NaN      Fathers and Sons

#### Работа с пропущенными данными

In [14]:
df4.loc[df4['book_title'].isnull(), :]

   author_id author_name book_title
0          1     Pushkin        NaN

In [15]:
df4.loc[df4['book_title'].notnull(), :]

   author_id author_name            book_title
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4         NaN      Fathers and Sons

In [16]:
df4['book_title'] = df4['book_title'].fillna('unknown')

In [17]:
df4

   author_id author_name            book_title
0          1     Pushkin               unknown
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4         NaN      Fathers and Sons

In [18]:
df4['author_name'] = df4['author_name'].fillna('unknown')

In [19]:
df4

   author_id author_name            book_title
0          1     Pushkin               unknown
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4     unknown      Fathers and Sons

#### Добавление столбцов

In [20]:
df4.loc[(df4['author_name'] != 'unknown') & (df4['book_title'] != 'unknown'), 'quantity'] = 1

In [21]:
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown       NaN
1          2     Tolstoy         War and Peace       1.0
2          3  Dostoevsky             The Idiot       1.0
3          3  Dostoevsky  Crime and Punishment       1.0
4          4     unknown      Fathers and Sons       NaN

In [22]:
df4['quantity'].fillna(0, inplace=True)

In [23]:
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown       0.0
1          2     Tolstoy         War and Peace       1.0
2          3  Dostoevsky             The Idiot       1.0
3          3  Dostoevsky  Crime and Punishment       1.0
4          4     unknown      Fathers and Sons       0.0

In [24]:
df4['quantity'] = df4['quantity'].astype('int')

In [25]:
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

In [26]:
df4.set_index('author_id', inplace=True)

In [27]:
df4

          author_name            book_title  quantity
author_id
1             Pushkin               unknown         0
2             Tolstoy         War and Peace         1
3          Dostoevsky             The Idiot         1
3          Dostoevsky  Crime and Punishment         1
4             unknown      Fathers and Sons         0

In [28]:
df4.index

Int64Index([1, 2, 3, 3, 4], dtype='int64', name='author_id')

In [29]:
df4.reset_index(inplace=True)

In [30]:
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

#### Удаление данных

In [31]:
df4['price'] = 500

In [32]:
df4

   author_id author_name            book_title  quantity  price
0          1     Pushkin               unknown         0    500
1          2     Tolstoy         War and Peace         1    500
2          3  Dostoevsky             The Idiot         1    500
3          3  Dostoevsky  Crime and Punishment         1    500
4          4     unknown      Fathers and Sons         0    500

In [33]:
df4.drop('price', axis=1, inplace=True)

In [34]:
df4.drop(1, axis=0, inplace=True)

In [35]:
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

In [36]:
df4 = df4.append(pd.DataFrame({'author_id': [2],
                               'author_name': ['Tolstoy'],
                               'book_title': ['War and Piece'],
                               'quantity': [1]}, columns = ['author_id', 'author_name', 'book_title', 'quantity']))

In [37]:
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0
0          2     Tolstoy         War and Piece         1

In [38]:
df4 = df4.sort_values(by='author_id')

In [39]:
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
0          2     Tolstoy         War and Piece         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

In [40]:
df4 = df4.reset_index(drop=True)

In [41]:
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Piece         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

#### Конкатенация датафреймов

##### по оси 0 (добавление новых строк)

In [43]:
df5 = pd.DataFrame({'author_id': [3, 5],
                    'author_name': ['Dostoevsky', 'Chekhov'],
                    'book_title': ['The Gambler', 'Three Sisters'],
                    'quantity': [2, 3]}, columns = ['author_id', 'author_name', 'book_title', 'quantity'])

In [44]:
df5

   author_id author_name     book_title  quantity
0          3  Dostoevsky    The Gambler         2
1          5     Chekhov  Three Sisters         3

In [45]:
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Piece         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

In [46]:
df6 = pd.concat([df4, df5], axis=0, ignore_index=True)

In [47]:
df6

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Piece         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0
5          3  Dostoevsky           The Gambler         2
6          5     Chekhov         Three Sisters         3

##### По оси 1 (добавление новых столбцов)

In [48]:
prices = pd.DataFrame({'price': [700, 450, 500, 400, 350]}, columns=['price'], index=[1, 2, 3, 5, 6])

In [49]:
prices

   price
1    700
2    450
3    500
5    400
6    350

In [51]:
df7 = pd.concat([df6, prices], axis=1)
df7

   author_id author_name            book_title  quantity  price
0          1     Pushkin               unknown         0    NaN
1          2     Tolstoy         War and Piece         1  700.0
2          3  Dostoevsky             The Idiot         1  450.0
3          3  Dostoevsky  Crime and Punishment         1  500.0
4          4     unknown      Fathers and Sons         0    NaN
5          3  Dostoevsky           The Gambler         2  400.0
6          5     Chekhov         Three Sisters         3  350.0

#### Применение функций и методов

In [52]:
df7['total'] = df7['quantity'] * df7['price']
df7

   author_id author_name            book_title  quantity  price   total
0          1     Pushkin               unknown         0    NaN     NaN
1          2     Tolstoy         War and Piece         1  700.0   700.0
2          3  Dostoevsky             The Idiot         1  450.0   450.0
3          3  Dostoevsky  Crime and Punishment         1  500.0   500.0
4          4     unknown      Fathers and Sons         0    NaN     NaN
5          3  Dostoevsky           The Gambler         2  400.0   800.0
6          5     Chekhov         Three Sisters         3  350.0  1050.0

In [54]:
df7['total'].max()

1050.0

In [55]:
df7['price'].min()

350.0

In [56]:
df7.price.mean()

480.0

In [57]:
df7.price.median()

450.0

In [58]:
df7.price.std()

135.09256086106296

In [59]:
df7.price.var()  # дисперсия

18250.0

In [61]:
df7.nlargest(3, 'price') # вывод нескольких макимальных значений

   author_id author_name            book_title  quantity  price  total
1          2     Tolstoy         War and Piece         1  700.0  700.0
3          3  Dostoevsky  Crime and Punishment         1  500.0  500.0
2          3  Dostoevsky             The Idiot         1  450.0  450.0

In [62]:
df7.author_name.unique()

array(['Pushkin', 'Tolstoy', 'Dostoevsky', 'unknown', 'Chekhov'],
      dtype=object)

In [63]:
df7.author_name.nunique()

5

In [65]:
df7['author_name'].value_counts()

Dostoevsky    3
Pushkin       1
Tolstoy       1
unknown       1
Chekhov       1
Name: author_name, dtype: int64

#### Применение функций не входящих в numpy or pandas

In [67]:
df7['book_title'].apply(lambda x: x.upper())

0                 UNKNOWN
1           WAR AND PIECE
2               THE IDIOT
3    CRIME AND PUNISHMENT
4        FATHERS AND SONS
5             THE GAMBLER
6           THREE SISTERS
Name: book_title, dtype: object

#### Группировка данных

#### 1 способ

In [68]:
df7.groupby('author_name')['price'].max()

author_name
Chekhov       350.0
Dostoevsky    500.0
Pushkin         NaN
Tolstoy       700.0
unknown         NaN
Name: price, dtype: float64

#### 2 способ

In [69]:
price_agg = df7.groupby('author_name').agg({'price': 'max'})

In [70]:
price_agg

             price
author_name
Chekhov      350.0
Dostoevsky   500.0
Pushkin        NaN
Tolstoy      700.0
unknown        NaN

#### Переименование столбца

In [71]:
price_agg = price_agg.reset_index()

In [72]:
price_agg = price_agg.rename(columns={'price': 'price_max'})

In [73]:
price_agg

  author_name  price_max
0     Chekhov      350.0
1  Dostoevsky      500.0
2     Pushkin        NaN
3     Tolstoy      700.0
4     unknown        NaN